---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalGeometryId
source: html/5b66dc57-0e17-5c59-41ff-84d8686fe635.htm
---
# ExternalGeometryId Methods

Determines whether the specified Object is equal to the current Object .